const express = require('express')

const app = express()

app.use(express.json())

let foodSample,result
app.get('/main', (req, res) => {
    foodSample = ['กระเพราไก่ไข่ดาว', 'ข้าวผัด', 'ผัดเปรี้ยวหวาน', 'ราดหน้า', 
        'ผัดผงกระหรี่', 'ผัดขี้เมา', 'ผัดพริกไทยดำ', 'ผัดพริกเผา', 'ผัดซีอิ้ว',
        'ยำวุ้นเส้น', 'มักกะโรนีผัด', 'ข้าวไข่เจียว', 'สุกี้แห้ง', 'สุกี้นํ้า',
        'ทอดกระเทียม', 'ข้าวไข่ข้น', 'ยำมาม่า', 'มาม่า', 'โจ๊ก',' ชาบูหม่าล่า','ผัดหมี่', 'หมูแดง', 'เป็ดปักกิ่ง', 'ไก่ผัดเม็ดมะม่วงหิมพานต์', 'ไก่แช่เหล้า', 'สามชั้นตุ๋นเต้าเจี้ยว', 'ปีกไก่เหล้าแดง', 'ผัดโป๊ยเซียน', 'เป็ดตุ๋นเกาลัด', 'กระเพาะปลา', 'ขาหมูตุ๋นยาจีน', 'เป็ดพะโล้', 'ไก่ตุ๋นซีอิ๊ว', 'ข้าวอบจักรพรรดิ', 'กุ้งอบวุ้น', 'เต้าหู้นัดไส้นึ่งซีอิ๊ว', 'ข้าวหมกไก่', 'ไก่ทันดูรี', 'แกงไก่ทิกก้ามาซาล่า', 'ซาโมซ่า', 'ปานี ปูริ', 'แกงมาซาลาเนยปะนีร์', 'เคบับ', 'บิบิมบับ', 'ซัมกยอบซัล', 'บูลโกกิ', 'ต๊อกบกกี', 'จาจังมยอน', 'หมี่ไก่ฉีก', 'ซัมกเยทัง', 'ซูชิ','ราเมน','ข้าวหน้าปลาไหล','เนื้อย่าง','สุกี้ยากี้','ข้าวหน้าเนื้อ','ข้าวแกงกะหรี่','โอโคโนมิยากิ','ยากิโซบะ','ข้าวปลาซันมะย่างเกลือ','ข้าวทงคัตสึ','บะหมี่เย็น','โอฉะสึเกะ','ไข่ตุ๋น','ซาชิมิ','โอนิกิริ','เทอริยากิ','โอมุไรซ์', 'กระทงทอง', 'ก๋วยเตี๋ยวคั่วไก่', 'ก๋วยเตี๋ยวราดหน้าปลาเต้าซี่', 'กุ้งต้มเค็ม', 'กุ้งนึ่งซีอิ๊ว', 'กุ้งผัดพริกขี้หนูสด', 'แกงกะหรี่ไก่', 'แกงเขียวหวานไก่พริกขี้หนูสด', 'แกงเขียวหวานหอยลายยอดมะพร้าว', 'แกงคั่วเนื้อมันเทศ', 'แกงคั่วเห็ดโคนญี่ปุ่นยอดชะอม', 'แกงมัสมั่นไก่', 'แกงเลียงกุ้งสด', 'แกงสายบัวต้มกะทิ', 'แกงหน่อไม้ใบยี่หร่า', 'ไก่คั่วผักชีพริกแห้ง', 'ไก่ตุ๋นน้ำแดง', 'ไก่ทอดซีอิ๊ว', 'ไก่ย่างซอสพะแนง', 'ไก่ห่อใบเตย', 'ขนมจีนซาวน้ำแจงลอน', 'ข้าวผัดขี้เมาปลาสลิด', 'ข้าวหน้าไก่', 'ข้าวหมกไก่', 'ไข่ตุ๋นกุ้งจี๊ดจ๊าด', 'ไข่เผ็ด', 'ไข่พะโล้', 'ซุปไก่', 'ซุปไก่ใส่ฟักต้มขมิ้น', 'ต้มข่าไก่โบราณ', 'ต้มยำกุ้งน้ำใส', 'ตับทอดซอสน้ำปลาหวาน', 'เต้าหู้ขาวผัดขี้เมา', 'น้ำพริกกะปิมะกรูด', 'น้ำพริกกะปิมะดัน', 'น้ำพริกกุ้งขยำ', 'น้ำพริกไข่ปู', 'เนื้อเค็มต้มกะทิ', 'ปลาช่อนต้มเต้าเจี้ยวเกี่ยมฉ่าย', 'ปลาช่อนแป๊ะซะโบราณ', 'ปลาแซลมอนราดซอสเปรี้ยวหวาน', 'ปลาทับทิมสูตรพริกเขียว', 'ปลาทูเจี๋ยน', 'ปลาทูต้มมะดัน', 'ปลาหมึกผัดน้ำพริกเผาไข่เค็ม', 'เปาะเปี๊ยะผัดไทย', 'ผัดไทยกุ้งสด', 'ผัดไทยมะละกอ', 'ผัดโหงวก้วย', 'เมี่ยงกุ้ง', 'เมี่ยงไก่', 'เมี่ยงปลาทู', 'เมี่ยงปลานิล', 'ยำก้านคะน้าจีนกุ้งสด', 'ยำชะอมกรอบกุ้ง', 'ยำเห็ดฟางกุ้งสด', 'ยำใบชะคราม','ยำส้มโอโบราณ', 'เย็นตาโฟ', 'ส้มตำไหลบัว', 'หมี่กะทิ', 'หมี่ผัดกระเฉด', 'หอยทอด', 'ผัดไทย', 'บรูเชตตา', 'ลาซานญา', 'ริซอตโต', 'พิซซา', 'พาสตา', 'ฟอกาเซีย'];
    result = foodSample[Math.floor(Math.random() * foodSample.length)];
    res.status(200).json({
        data: result
    })
})

app.get('/dessert', (req, res) => {
    foodSample = ['โมจิ','ดังโงะ','วากาชิ','ไทยากิ','โดรายากิ','มิซุชิงเง็นโมจิ','คุกกี้งา','ชีสเค้กญี่ปุ่น','เค้กโรล','เค้กคัสเตลา','คุกกี้ชาเขียว','ไดฟูกุ','พุดดิ้ง','มันหวาน','โชกุปัง','เมกะ ฮิโยโกะ','วาราบิโมจิ','โยคัง','เซมเบ้','เมล่อนปัง','ชีสทาร์ต','บวามคุเฮ็น','คัสเทลล่า','ชูครีม','ซอฟครีม','เครปเค้ก','ป๊อกกี้', 'ไอศครีมซอฟต์เสิร์ฟ', 'โดนัท', 'ดงแบง', 'Honey Toast', 'เค้กข้าว', 'เค้กไอศครีม', 'ต๊อกโบกีย่าง', 'อินจอลมี โมจิเกาหลี', 'โฮต็อก', 'ดัลโกนา', 'บิงซู', 'ออมเล็ตปัง', 'Gulab Jamun', 'Ras malai', 'Kulfi', 'Gujar Ka Halwa', 'Shrikhand', 'Kheer', 'Seviyaan', 'Boondi ka Laddo', 'Jalebi', 'Peda', 'Shahi Tukra', 'Kalakand', 'พุดดิ้งมะม่วง', 'Puran Poli', 'Sandesh', 'Kaju ki Barfi', 'Modak', 'Rasgulla', 'ขนมเทียน','ขนมไหว้พระจันทร์','ขนมเปี๊ยะกุหลาบ','ขนมโก๋','หมี่หวาน','บัวลอยเผือกน้ำขิง','โบ๊กเกี้ย','โอนีแปะก๊วย','ขนมเข่ง','ขนมปุยฝ้าย','ขนมไข่','ขนมแต้เหลียว','ถังหูลู่','ขนมกุ้ยฮวา','ขนมหมวดมังกร','ขนมเฉียวกั่ว', 'มาการอง','วาฟเฟิล','ครัวซองต์','ชูโรส','ทาร์ตไข่','เครป','มิลล์เฟย','คานาเล่','แครมบรูว์เล','เอลแคลร์','มาเดอลีน','พายเลม่อน','ช็อกโกแลตซูเฟล่','กลาโฟติส์','ทาร์ต','มองบลังค์','แอปเปิ้ลชุปแป้งทอด','ชาลบอลเลน','แคนโนลี','โดนัท','ขนมอบเพรทเซิล','สโตรปวาฟเฟิล','ช็อกโกแลตฟองดูต์'];
    result = foodSample[Math.floor(Math.random() * foodSample.length)];
    res.status(200).json({
        data: result
    })
})

app.get('/snack', (req, res) => {
    foodSample = ['ทาโกะยากิ','เกี๊ยวซ่า','ไข่หวานย่าง','ปลาหมึกย่าง','ยากิโตริ','ข้าวโพดย่าง','โอเด้ง','โคร็อกเกะ','เทมปุระ','คาราอาเกะ','ทงคัตสึ','คุชิคัตสึ','นัตโตะ', 'ซีเรียล', 'ขนมปังกระเทียมครีมชีส', 'ขนมปังกรอบคาราเมล', 'พิซซ่าเกาหลี', 'เครันปัง', 'เค้กมันฝรั่งน้ำผึ้ง', 'ขนมปังอุนจิ', 'มันฝรั่งเกลียวทอนาโด', 'ซุนแด', 'มันดู', 'ออมุก', 'พุงออปัง', 'ต๊อกชีสทอด', 'ไก่ทอดเกาหลี', 'คิมบับ', 'คอร์นด็อก', 'ซาโมซ่า', 'โดซา', 'เปา บาจี', 'บอมเบย์ ดั๊ค', 'วาดะเปา', 'อาลู ทิคคี', 'ปาปรี จาฏ', 'กูลฟี', 'เบห์ล ปุรี', 'จาเลบี้', 'เมดู วาดะ', 'คาโชรี่', 'ลาสซี่', 'โชเล บัตตูเร', 'ซาลาเปา','ขนมกุยช่าย','เกี๊ยว','เสี่ยวหลงเปา','ติ่มซำ','บ๊ะจาง','เปาะเปี๊ยะ','เต้าหู้เหม็นทอด','ซงโหยวปิ่ง','หอยจ๊อ','ก๋วยเตี๋ยวหลอด', 'ซี่โครงหมูบาร์บีคิว', 'ชีสทอด', 'ปลาหมึกทอด', 'แซลมอนวาซาบิ', 'ปูอัดวาซาบิ', 'เฟรนฟราย', 'โพรซูโต', 'คาเปรเซ่สลัด'];
    result = foodSample[Math.floor(Math.random() * foodSample.length)];
    res.status(200).json({
        data: result
    })
})

app.get('/drink', (req, res) => {
    foodSample = ['โกโก้มัคคิอาโต้', 'ไมโลโรงเรียน', 'น้ำกระเจี๊ยบ', 'น้ำเก๊กฮวย', 'นมข้าวโพด', 'น้ำใบเตย', 'น้ำมะตูม', 'อเมริกาโน่', 'เอสเพรสโซ่', 'คาปูชิโน่', 'ลาเต้', 'มอคค่า', 'นมหมีปั่น บราวชูก้า', 'นมหมีปั่นโกโก้', 'นมหมีปั่นนมชมพู', 'นมหมีปั่นมัทฉะ', 'นมหมีมะพร้าวปั่น',' นมหมี เนสกาแฟปั่น', 'นมหมีชีสเค้กปั่น', 'นมหมีปั่นชาไทย', 'นมหมีปั่นคาราเมล', 'น้ำแตงโมปั่น', 'น้ำส้มปั่น', 'น้ำมะนาวปั่น', 'น้ำแครอทมะนาวปั่น', 'น้ำมะม่วงปั่น', 'น้ำสับปะรดปั่น', 'น้ำกีวี่ปั่น', 'น้ำมะพร้าวปั่น', 'น้ำเสาวรสน้ำผึ้งปั่น', 'น้ำแดงมะนาวโซดา', 'น้ำผึ้งมะนาวโซดา', 'ลิ้นจี่สตรอว์เบอร์รีโซดา', 'มินท์มะนาวโซดา', 'ชามะนาวโซดา', 'มะม่วงโซดา', 'ชาเขียวมะนาวโซดา', 'บ๊วยน้ำแดงโซดา', 'น้ำเขียวมะนาวโซดา', 'น้ำเขียวมะนาวโซดา', 'ยูซุบลูโซดา', 'ราสเบอร์รี่โซดา', 'น้ำผลไม้','น้ำส้ม','น้ำมะนาว','น้ำแอปเปิ้ล','น้ำมะม่วง','น้ำมะตูม','น้ำบ๊วย','น้ำเก๊กฮวย','น้ำมะขาม','ช็อคโกแลตร้อน','โกโก้','ชาเย็น','ชาร้อน','ชาดำ','ชาเขียว','ชาผลไม้','ชาสมุนไพร','น้ำอัดลม','โซดา', 'น้ำโคล่า' ,'น้ำแปล่า','น้ำแร่','นม','นมปั่น' ,'เหล้า','เบียร์','ไวน์','แชมเปญ','ค็อกเทล','พันช์','บรั่นดี','เหล้าวิสกี้','เหล้ากลั่น','เหล้าเตกีล่า'];
    result = foodSample[Math.floor(Math.random() * foodSample.length)];
    res.status(200).json({
        data: result
    })
})


app.listen(5000, () => {
    console.log('success')
})